#include <bits/stdc++.h>

using namespace std;

/**
　 i⌒i
　　　|　|　　　(ﾟ)(ﾟ)
　　　|　|　　彡　　と
　　 　| |　＿ﾉ　　　ー､
　　　（ミ)、　　　　!ﾌ　/
　　　￠＼二二二__ノ　　　　　　　　　　　　　　　ﾎﾟｲｯ
　　　　　　|　　　 /　　　　　　　　　　　　　 ◯ ⌒　⊂(・ω・`)、
　　　 　／ ソ⌒ 、ヽ　　　　　　　　　　　　　　　　　　　ヽ　　と)
　　　　(　< 　　　ヽ　）　　　　　　　　　　　　　　　　　　　｀ｕ-ｕ'
　　　⊂＿）　　　（＿つ



　 　 i⌒i
　　　|　|　　　(ﾟ)(ﾟ)
　　　|　|　　彡　　と
　　 　| |　＿ﾉ　　　ー､
　　　（ミ)、　　　　!ﾌ　/
　　　￠＼二二二__ノ　　　　　　　　　　　　　ｼｭｯ!!
　　　　　　|　　　 /　　　　　　　　◯三二≡＝─　⊂(・ω・´)、
　　　 　／ ソ⌒ 、ヽ　　　　　　　　　　　　　　　　　　　ヽ　　と)
　　　　(　< 　　　ヽ　）　　　　　　　　　　　　　　　　　　　｀ｕ-ｕ'
　　　⊂＿）　　　（＿つ



　　　i⌒i
 　　　|　|　　　(ﾟ)(ﾟ)
 　　　|　|　　彡　　と
 　　 　| |　＿ﾉ　　　ー､
 　　　（ミ)、　　　　!ﾌ　/
 　　　￠＼二二二__ノ　　　　　　　　　　　　　ｼｭｯ!!
 　　　　　　|　　　 /　　　　　　　　◯三二≡＝─　⊂(・ω・´)、
 　　　 　／ ソ⌒ 、ヽ　　　　　　　　　　　　　　　　　　　ヽ　　と)
 　　　　(　< 　　　ヽ　）　　　　　　　　　　　　　　　　　　　し-- ⊃
 　　　⊂＿）　　　（＿つ



　 　 i⌒i
　　　|　|　　　(ﾟ)(ﾟ)
　　　|　|　　彡　　と
　　 　| |　＿ﾉ　　　ー､
　　　（ミ)、　　　　!ﾌ　/
　　　￠＼二二二__ノ　　　　　　　　　　　　　ｼｭｯ!!
　　　　　　|　　　 /　　　　　　　　　　　彡≡＝─　⊂(・ω・´)、
　　　 　／ ソ⌒ 、ヽ　　　　　　　　○　　　　　　　　　 ヽ　　と)
　　　　(　< 　　　ヽ　）　　　　　　　　　ｸｲｯ　　　　　　　　｀ｕ-ｕ'
　　　⊂＿）　　　（＿つ



　　　i⌒i
 　　　|　|　　　(ﾟ)(ﾟ)
 　　　|　|　　彡　　と
 　　 　| |　＿ﾉ　　　ー､
 　　　（ミ)、　　　　!ﾌ　/
 　　　￠＼二二二__ノ　　　　　　　　　　　　　ｼｭｯ!!
 　　　　　　|　　　 /　　　　　　　　彡三二≡＝─　⊂(・ω・´)、
 　　　 　／ ソ⌒ 、ヽ　　　　　○　　　　　　　　　　　　 ヽ　　と)
 　　　　(　< 　　　ヽ　）　　　　　　　　ｸｲｯ　　　　　　　　 し-- ⊃
 　　　⊂＿）　　　（＿つ



　　　　　　　(ﾟ)(ﾟ)
　　　　　　彡u 　と
.(二二ﾆ=ＯＯ≡ｌ_ ﾉ　　　　　　　　　　　　　ｼｭｯ!!
　　　　　　 〉---9/ 彡≡≡≡≡≡≡≡≡＝─　⊂(・ω・´)、
　　 　 　　ﾉ_＼_＼　ｸｲｯ　　　　　　　　　　　　　　　　　ヽ　　と)
　　　　○ し'　（＿)　　　　　　　　　　　　　　　　　　　　 し-- ⊃




　　　i⌒i
 　　　|　|　　　(ﾟ)(ﾟ)
 　　　|　|　　彡　　と　　　　　　　彡　＝　ミ
 　　 　| |　＿ﾉ　　　ー､　　 　彡　　　　　　 ミ　
 　　　（ミ)、　　　　!ﾌ　/　　彡　　　　　　　　　ミ
 　　　￠＼二二二__ノ　○　　　　　　　　　　　　＼　ｼｭｯ!!
 　　　　　　|　　　 /　　　　　　　　　　　　　　　　　　⊂(・ω・´)、
 　　　 　／ ソ⌒ 、ヽ　　　　　　　　　　　　　　　　　 　 ヽ　　と)
 　　　　(　< 　　　ヽ　）　　　　　　　　　　　　　　　　　　 し-- ⊃
 　　　⊂＿）　　　（＿つ



　 　 i⌒i
　　　|　|　　　(ﾟ)(ﾟ)
　　　|　|　　彡u　と
　　 　| |　＿ﾉ　　　ー､
　　　（ミ)、　　　　!ﾌ　/
　　　￠＼二二二__ノ　　　　　　　　　　　　　ｷﾞｭﾝ!!
　≡≡　　|　　　 ≡≡　　≡≡　≡≡≡≡＝─　⊂(・ω・´)、
<ｽﾞﾄﾞﾝ!／ ソ⌒ 、ヽ　　　　　　　　　　　　　　　　　　　 ヽ　　と)
　　　　(　< 　　　ヽ　）　　　　　　　　　　　　　　　　　　　し-- ⊃
　　　⊂＿）　　　（＿つ



　 　 i⌒i
　　　|　|　　　(ﾟ)(ﾟ)
　　　|　|　　彡u　と
　　 　| |　＿ﾉ　　　ー､
　　　（ミ)、　　　　!ﾌ　/
　　　￠＼二二二__ノ　　　　　　　　　　　　　ｷﾞｭﾝ!!
≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡＝─ ⊂(・ω・´)、
<ｽﾞﾄﾞﾝ!／ ソ⌒ 、ヽ　　　　　　　　　　　　　　　　　　　 ヽ　　と)
　　　　(　< 　　　ヽ　）　　　　　　　　　　　　　　　　　　　し-- ⊃
　　　⊂＿）　　　（＿つ



　 　 i⌒i
 　　　|　|　　　(ﾟ)(ﾟ)
 　　　|　|　　彡u　と
 　　 　| |　＿ﾉ　　　ー､
 　　　（ミ)、　　　　!ﾌ　/
 　　　￠＼二二二__ノ　　　　　　　　　　　　　ｷﾞｭﾝ!!
 　　　　　（　　　（○≡≡≡≡≡≡≡≡≡≡＝─ ⊂(・ω・´)、
 　　　　／ ソ⌒ 、ヽ　<ｽﾞﾄﾞﾝ!　　　　　　　　　　　　　　 ヽ　　と)
 　　　　(　< 　　　ヽ　）　　　　　　　　　　　　　　　　　　　し-- ⊃
 　　　⊂＿）　　　（＿つ



　 　 i⌒i
　　　|　|　　　(ﾟ)(ﾟ)
　　　|　|　　彡　　と
　　 　| |　＿ﾉ　　　ー､
　　　（ミ)、　　　　!ﾌ　/　　　　　　　　　　　　　　左でも投げれるよ！
　　　￠＼二二二__ノ
　　　　　　|　　　 /　　　　　　　　　　　　　　　ｼｭｯ!!　(ω・´　)⊃
　　　 　／ ソ⌒ 、ヽ　　　　　　　◯三二≡＝─　　　と　　　)
　　　　(　< 　　　ヽ　）　　　　　　　　　　　　　　　　　　　ι｀-⊃
　　　⊂＿）　　　（＿つ



　 　 i⌒i
　　　|　|　　　(ﾟ)(ﾟ)
　　　|　|　　彡u　と
　　 　| |　＿ﾉ　　　ー､
　　　（ミ)、　　　　!ﾌ　/　　　　ｸｸｯ
　　　￠＼二二二__ノ　　　/ ＼　
　　　　　　|　　　 /　　　　/ /＼＼　　　　　　ﾋﾟｼｭｩｯ!! (ω・´　)⊃
　　　 　／ ソ⌒ 、ヽ　　 / /　　＼二二ニニ＝＝─　　と　　　)
　　　　(　< 　　　ヽ　）（（○））　　　　　　　　　　　　　　　 ι｀-⊃
　　　⊂＿）　　　（＿つ　　ｸﾞﾗｸﾞﾗ



　 　 i⌒i
　　　|　|　　　(ﾟ)(ﾟ)
　　　|　|　　彡u　と
　　 　| |　＿ﾉ　　　ー､
　　　（ミ)、　　　　!ﾌ　/　　
　　　￠＼二二二__ノ　　
　　　　　　|　　　 /　　　　　　　　　　　　　　　ﾋﾟｼｭｩｯ!! (ω・´　)⊃
　 ○ニ／ ソニ 、ヽニニニニニニニニニニ＝＝─　　と　　　)
　　　　(　< 　　　ヽ　）　　　　　　　　　　　　　　　　　　　 ι｀-⊃
　　　⊂＿）　　　（＿つ　　



　　 i⌒i
　　　|　|　　　(ﾟ)(ﾟ)
　　　|　|　　彡u　と
　　 　| |　＿ﾉ　　　ー､
　　　（ミ)、　　　　!ﾌ　/
　　　¢＼二二二__ノ
　　　　　　|　　　 /　　　　　　　　　　　　　ｱﾝﾀﾞｰ　　　　(ω・´　)∩
　　　 　／ ソ⌒ 、ヽ　　　　　　　　　　　　　　　　　　　／_、　i⌒i-、
　　　　(　< 　　　ヽ　）○ーー＝≡二三二≡＝─彡と´　 ~`（＿）J
　　　⊂＿）　　　（＿つ



　　　i⌒i　　　　!?
 　　　|　|　　　(ﾟ)(ﾟ)
 　　　|　|　　彡　((○　ﾄﾞｺﾞｯ
 　　 　| |　＿ﾉ　　　ー､　＼＼
 　　　（ミ)、　　　　!ﾌ　/ 　　＼＼
 　　　￠＼二二二__ノ　　　　　　＼＼ｷﾞｭｲﾝ　　　　　ｼｭｯ!!
 　　　　　　|　　　 /　　　　　　　　　　三二≡＝─　⊂(・ω・´)、
 　　　 　／ ソ⌒ 、ヽ　　　　　　　　　　　　　　　　　　　ヽ　　と)
 　　　　(　< 　　　ヽ　）　　　　　　　　　　　　　　　　　　　｀ｕ-ｕ'
 　　　⊂＿）　　　（＿つ



　 　 i⌒i
 　　　|　|　　　(ﾟ)(ﾟ)
 　　　|　|　　彡u　と
 　　 　| |　＿ﾉ　　　ー､
 　　　（ミ)、　　　　!ﾌ　/
 　　　￠＼二二二__ノ　　　　　ﾋﾟﾀｯ　　　　　　　　ｼｭｯ!!
 　≡≡　　|　　　 　/　　　　　　○≡≡≡≡＝─　⊂(・ω・´)、
 <ｽﾞﾄﾞﾝ!／ ソ⌒ 、ヽ　　　　　　　　　　　　　　　　　　　 ヽ　　と)
 　　　　(　< 　　　ヽ　）　　　　　　　　　　　　　　　　　　　し-- ⊃
 　　　⊂＿）　　　（＿つ



　 　 i⌒i
 　　　|　|　　　(ﾟ)(ﾟ)
 　　　|　|　　彡u　と
 　　 　| |　＿ﾉ　　　ー､
 　　　（ミ)、　　　　!ﾌ　/
 　　　￠＼二二二__ノ　　　　　ﾌｯ!　　　　　　　　ｼｭｯ!!
 　≡≡≡|・　　 　/　　　　　　川≡≡≡≡＝─　⊂(・ω・´)、
 <ｽﾞﾄﾞﾝ!／ ソ,　 、ヽ　　　　　　, 　　　　　　　　　　　　 ヽ　　と)
 　　　　(　< 　　・ ヽ, ）　　　　,　　　　　　　　　　　　　　　し-- ⊃
 　　　⊂＿）　　　（＿つ・　・



　　　i⌒i
 　　　|　|　　　(ﾟ)(ﾟ)
 　　　|　|　　彡　　と
 　　 　| |　＿ﾉ　　　ー､
 　　　（ミ)、　　　　!ﾌ　/
 　　　￠＼二二二__ノ　　　　　　　　　　　　　ｷﾞｭｲﾝ!!
 　　　　　　|　　　 /　　　　◯∽∽∽∽∽∽∽∽　⊂(・ω・´)、
 　　　 　／ ソ⌒ 、ヽ　　　　　　　　　　　　　　　　　　　ヽ　　と)
 　　　　(　< 　　　ヽ　）　　　　　　　　　　　　　　　　　　　し-- ⊃
 　　　⊂＿）　　　（＿つ



　　　i⌒i
 　　　|　|　　　(ﾟ)(ﾟ)
 　　　|　|　　彡　　と
 　　 　| |　＿ﾉ　　　ー､
 　　　（ミ)、　　　　!ﾌ　/
 　　　￠＼二二二__ノ　　　　　　　　　　　　　ｷﾞｭﾙﾝ!!
 　　　　　　|　　　 /　　　　◯ℓℓℓℓℓℓℓℓℓℓℓℓℓℓℓℓℓℓℓ⊂(・ω・´)、
 　　　 　／ ソ⌒ 、ヽ　　　　　　　　　　　　　　　　　　　ヽ　　と)
 　　　　(　< 　　　ヽ　）　　　　　　　　　　　　　　　　　　　し-- ⊃
 　　　⊂＿）　　　（＿つ



　 　 i⌒i
 　　　|　|　　　(ﾟ)(ﾟ)
 　　　|　|　　彡u　と
 　　 　| |　＿ﾉ　　　ー､
 　　　（ミ)、　　　　!ﾌ　/
 　　　￠＼二二二__ノ　　　　　　ﾋﾟﾀｯ　　　　　ｷﾞｭﾝ!!
 　　　　　（　　　（○≡　　　　　○≡≡≡≡＝─　⊂(・ω・´)、
 <ｽﾞﾄﾞﾝ!／ ソ⌒ 、ヽ　　　　　　　　　　　　　　　　　　　 ヽ　　と)
 　　　　(　< 　　　ヽ　）　　　　　　　　　　　　　　　　　　　し-- ⊃
 　　　⊂＿）　　　（＿つ



　　　i⌒i　　　　　　　　　　ll　　　　　　　　　　 l
 　　　|　|　　　(ﾟ)(ﾟ)　　　　 ll　　　　　　　　　　　 l
 　　　|　|　　彡　　と　　　ll　　　　　　　　　　　　 l
 　　 　| |　＿ﾉ　　　ー､　ll 　　　　　　　　　 　　　 l　
 　　　（ミ)、　　　　!ﾌ　/ lll　　　　　　　　　　　 　　 l
 　　　￠＼二二二__ノ　○　　　　　　　　　　　　　 ｜ﾌﾜｯ
 　　　　　　|　　　 /　　　　　　　　　　　　　　　　　　⊂(・ω・´)、
 　　　 　／ ソ⌒ 、ヽ　　　　　　　　　　　　　　　　　 　 ヽ　　と)
 　　　　(　< 　　　ヽ　）　　　　　　　　　　　　　　　　　　 し-- ⊃
 　　　⊂＿）　　　（＿つ




　　　　　　　　　ll　　　　　　　　　　　　　　　　　l
 　　　i⌒i　　　○　　　　　　　　　　　　　　　　　 l
 　　　|　|　　　(ﾟ)(ﾟ)　　　　 　　　　　　　　　　　　 l
 　　　|　|　　彡　　と　　　　　　　　　　　　　　　　 l
 　　 　| |　＿ﾉ　　　ー､　　 　　　　　　　　　 　　　 l　
 　　　（ミ)、　　　　!ﾌ　/ 　　　　　　　　　　　　 　　 l
 　　　￠＼二二二__ノ　　　　　　　　　　　　　　 　｜ﾌﾜｯ
 　　　　　　|　　　 /　　　　　　　　　　　　　　　　　　∩(・ω・´)、
 　　　 　／ ソ⌒ 、ヽ　　　　　　　　　　　　　　　　　 　 ヽ　　と)
 　　　　(　< 　　　ヽ　）　　　　　　　　　　　　　　　　　　 し-- ⊃
 　　　⊂＿）　　　（＿つ



　 　 i⌒i
 　　　|　|　　　(ﾟ)(ﾟ)
 　　　|　|　　彡u　と
 　　 　| |　＿ﾉ　　　ー､
 　　　（ミ)、　　　　!ﾌ　/
 　　　￠＼二二二__ノ　　　　　ﾌｯ!　　　　　　　　ｼｭｯ!!
 　≡≡≡|・　　 　/　　　　　　　　　　　　　　　　　　　　　(・ω・´)、
 <ｽﾞﾄﾞﾝ!／ ソ,　 、ヽ　　　　　　　　　　　　　　　　　　　⊂ヽ　　と)
 　　　　(　< 　　・ ヽ, ）　　　　　　　　　　　　　　　　・　　　し-- ⊃
 　　　⊂＿）　　　（＿つ・　・　・　・　・　・　・　・　・



　　　i⌒i
 　　　|　|　　　(ﾟ)(ﾟ)
 　　　|　|　　彡　　と
 　　 　| |　＿ﾉ　　　ー､　
 　　　（ミ)、　　　　!ﾌ　/
 　　　￠＼二二二__ノ　　　　　　　　　　　ﾌﾜｯ 　 　 (・ω・´)
 　　　　　　|　　　 /　　　　　　　　　　○ミ　 　　 　／!、 Ｙ （#)〉
 　　　 　／ ソ⌒ 、ヽ　　　　　　　　　　　　　　彡´　　 ヽi⌒i-、
 　　　　(　< 　　　ヽ　）　　　　　　　　　　　　　　 　 　 　（＿）J
 　　　⊂＿）　　　（＿つ



　　　i⌒i
 　　　|　|　　　(ﾟ)(ﾟ)
 　　　|　|　　彡　　と　　　　　　　
 　　 　| |　＿ﾉ　　　ー､　　 　　　　　　　 　
 　　　（ミ)、　　　　!ﾌ　/　　　　　　　　　　　　
 　　　￠＼二二二__ノ　　　ｸｸｯ　　　　　　　　　　　ｼｭｯ!!
 　　　　　　|　　　 /　　　　　　 三三三三三三ミ 　　　
 　　　 　／ ソ⌒ 、ヽ　　／／　　 　　　　　　　　ミ三三三三　　(・ω・´)⊃
 　　　　(　< 　　　ヽ　）　○　　　　　　　　　　　　　　　　　　　＼⊂し-- ⊃
 　　　⊂＿）　　　（＿つ



　　　i⌒i
 　　　|　|　　　(ﾟ)(ﾟ)
 　　　|　|　　彡　　と
 　　 　| |　＿ﾉ　　　ー､
 　　　（ミ)、　　　　!ﾌ　/
 　　　￠＼二二二__ノ　　　　　　　　　　　　　ｼｭｯ!!
 　　　　　　|　　　 /　　　　　　(・ω・´)三二≡＝─　⊂、
 　　　 　／ ソ⌒ 、ヽ　　　　　　　　　　　　　　　　　　 ヽ　　と)
 　　　　(　< 　　　ヽ　）　　　　　　　　　　　　　　　　　　 し-- ⊃
 　　　⊂＿）　　　（＿つ



　　　i⌒i 　　　　　て
 　　　|　|　　　(ﾟ)(ﾟ)　て 　
 　　　|　|　　彡　　と 　
 　　 　| |　＿ﾉ　　　ー､
 　　　（ミ)、　　　　!ﾌ　/ 　　　　　　◯≡＼
 　　　￠＼二二二__ノ　　　　　　　　◯≡＼　　　ｼｭｯ!!
 　　　　　　|　　　 /　　　　　　　　◯三二≡＝─　⊂(・ω・´)、
 　　　 　／ ソ⌒ 、ヽ　　　　　　　　　◯≡／　　　　　　ヽ　　と)
 　　　　(　< 　　　ヽ　）　　　　　　　　◯≡／　　　　　　　｀ｕ-ｕ'
 　　　⊂＿）　　　（＿つ 　　　　　　




　 　 i⌒i
　　　|　|　　　(ﾟ)(ﾟ)
　　　|　|　　彡u　と
　　 　| |　＿ﾉ　　　ー､ 　　　　　　　　　　　　　　　,　゛ 三 ミ　ヽ
　　　（ミ)、　　　　!ﾌ　/　　　　　　　　　　　　　　（ （ (`・ω・´) ） )
　　　￠＼二二二__ノ　　　　　　　　　　　　ｷﾞｭﾝ!!ヾヽﾐ 三彡, ソ′
≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡≡＝─ 　）ﾐ　　彡ノ　
<ｽﾞﾄﾞﾝ!／ ソ⌒ 、ヽ　　　　　　　　　　　　　　　　　　（ﾐ　彡
　　　　(　< 　　　ヽ　）　　　　　　　　　　　　　　　　　　＼(
　　　⊂＿）　　　（＿つ　　　　　　　　　　　　　　　　　　 )）
　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　 （



　 　i⌒i　　　　　　　　　　　　　　　　　　　　　　　　　　　　ﾋﾟｯ!　(・ω・´)⊃
 　　　|　|　　　(ﾟ)(ﾟ)　　　　　　　　　　　　　　　　　　　　　　　　　⊂し-- ⊃
 　　　|　|　　彡u　と　　　　　　　　　　　　　　　　　　　　　　／／　　　
 　　 　| |　＿ﾉ　　　ー､　　　　　　　　　　　　　　　　／／　
 　　　（ミ)、　　　　!ﾌ　/　　　　　　　　　　　　／／　　　　　　　
 　　　￠＼二二二__ノ　　　　　　　　　／／　　　　　　　　　
 　　　　　　|　　　 /　　　　　 　／／　
 　　　 　／ ソ⌒ 、ヽ　　 ○
 　　　　(　< 　　　ヽ　）　
 　　　⊂＿）　　　（＿つ　　　　　　　　　　　　　　　　　　　　　　　　　ｼｭﾊﾞｯ



　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　,　゛ 三 ミ　ヽ
　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　（ （ (`・ω・´) ） )
　　 　i⌒i　　　　　　　　　　　　　　　　　　　　　　ｼｭﾊﾞﾊﾞ!!　 ヾヽﾐ 三彡, ソ′
　　　|　|　　　(ﾟ)(ﾟ)　　　　　　　　　　　　　　　　　／　　　　　　 ）ﾐ　　彡ノ　
　　　|　|　　彡u　と　　　　　　　　　　　　　　 ／　　　　　　　　（ﾐ　彡
　　 　| |　＿ﾉ　　　ー､　　　　　　　　　　 ／／　　 　　　　　　　＼(
　　　（ミ)、　　　　!ﾌ　/　　　　　　　　／／／　　　　　　　　　 　　)）
　　　￠＼二二二__ノ　　　　　／／／／／　　　　　　　　　　　　（
　　　　　　|　　　 /　　　　　０ο○／／／　 　　　　　　　　　　　
　　　 　／ ソ⌒ 、ヽ　　 ○Ｏ○0○Ｏ／
　　　　(　< 　　　ヽ　）　Ο○ｏ○０Ο／
　　　⊂＿）　　　（＿つ　 Ο○Ｏ○　　　　　　　　　　　　　　　　　＿




　　　i⌒i
　　　|　|　　　(ﾟ)(ﾟ)
　　　|　|　　彡　　と
　　 　| |　＿ﾉ　　　／／　 ／_,. -;=''" _,
　　　（ミ)、　　　　/／　'-'"`"　-‐ニ‐"___=__---
　　　￠＼二二:/ﾚ　　　　____-__-_　　ｉ｀''-w´ヽ　ゝ,√"´＼　　　　　　　　/｀''-w´ヽ　,√"´＼　　　　∧　　/｀''-w´ヽ　　　　　√へ　ｼｭｯ!!
　　　　　　|　　.,/′○ 　　　　　　　　:　　　￣/ゝ￣￣￣￣ゝ￣￣￣￣|￣￣￣／￣￣￣￣ゝ￣/￣￣゛￣￣￣￣＼￣￣ｉﾞ￣￣ｿ￣⊂(・ω・´)、
　　 　　／ ソ⌒ヽ　　ヾ　　--_--_- 　　　 三＝￣￣￣￣ヽ､￣∟／￣ヾ_/￣￣ ヾ ''￣ﾟ ￣￣｀ヽ/￣￣￣￣￣￣￣￣ヾ─￣￣￣￣　　ヽ　　と)
　　　　(　< 　　ヾ＼＼:　　＼,. -;=''" _,.-;-　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　 ｀ｕ-ｕ
　　　⊂＿）　　　（＿＼ |＼ 　:: |i''-'"`"




　 　　　　　　　 i⌒i
　　　　　　　　　|　|　　　(ﾟ)(ﾟ) 　？？
　　　　　　　　　|　|　　彡　　と
　　　　　 　　　　| |　＿ﾉ　　　ー､
　　　　　　　　　（ミ)、　　　　!ﾌ　/
　　　　　　　　　￠＼二二二__ノ　　　　　　　　 　　
　　　 　 　　○　　　|　　　 　|　　　　　　　　　　　　　　ｼｭｯ! (・ω・´)、
　　 　　 　　| |　　 ／ ソ⌒ 、ヽ　　　　　　　　　　　　　 　　 （ ヽ　　と)
　　　　　　　||　　(　< 　　　ヽ　）　　　　　　　　　　　　　　|| 　　し-- ⊃
　ﾎﾞｼｭｯ!! ;::;;;;::; ⊂＿）　　　（＿つ 　　　　　　　ﾎﾞｽｯ!　;::;;;;::;;;




　　　i⌒i
　　　|　|　　　(ﾟ)(ﾟ)
　　　|　|　　彡　　と　　　　　　　
　　 　| |　＿ﾉ　　　ー､　　 　　　　　　　 　
　　　（ミ)、　　　　!ﾌ　/　　　　　　　　　　　　
　　　￠＼二二二__ノ　　　　　　　　　　　　　　　　ｶｼｭｯ!
　　　　　　|　　　 /　　　　　　　　　　　　　　　　　　　　　м
　　　 　／ ソ⌒ 、ヽ　　　　　　　　○＝＝＝＝＝＝＝＝(◎)ノ ⊂(・ω・´)、
　　　　(　< 　　　ヽ　）　　 　　　　　　　　　　　　　　　　　　　| |　　　ヽ　　と)
　　　⊂＿）　　　（＿つ 　　　　　　　　　　　　　　　　　　　　 | |　　　　｀ｕ-ｕ'
　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　 ￣￣



　 　 i⌒i
 　　　|　|　　　(ﾟ)(ﾟ)
 　　　|　|　　彡u　と
 　　 　| |　＿ﾉ　　　ー､
 　　　（ミ)、　　　　!ﾌ　/
 　　　￠＼二二二__ノ　　　　　　　　　　　　　ｷﾞｭﾝ!!
 　　　　　　|　　　 　|　　　　　　　　　　　　　　　　　 　⊂(・ω・´)、
 <ｽﾞﾄﾞﾝ!／ ソ⌒ 、ヽ　　　　　　　　　　　　　　　　　　　 ヽ　　と)
 　　　　(　< 　　　ヽ　）　　　　　　　　　　　　　　　　　　　し-- ⊃
 　　　⊂＿）　　　（＿つ



　 　 i⌒i　　　　　　
　　　|　|　　　(ﾟ)(ﾟ)　
　　　|　|　　彡u　と　　
　　 　| |　＿ﾉ　　　ー､ 　
　　　（ミ)、　　　　!ﾌ　/　
　　　￠＼二二二__ノ 　　　　　　　　　　　　ｼｭｯ!
　　　　　　|　　　 　|　　　　･ ≡≡≡≡＝─　⊂(・ω・´)、
　　　　 ／ ソ⌒ 、ヽ　　　　　　　　　　　　　 　　　 ヽ　　と)
　　　　(　< 　　　ヽ　）　　　　　　　　　　　　　　　　　し-- ⊃
　　　⊂＿）　　　（＿つ




　 　 i⌒i
　　　|　|　　　(ﾟ)(ﾟ)
　　　|　|　　彡　　と
　　 　| |　＿ﾉ　　　ー､
　　　（ミ)、　　　　!ﾌ　/
　　　￠＼二二二__ノ　
　　　　　　|　　　 /　　　　　　　　　　　　　　　　　　　　　 (ω・｀　)
＜ボール ソ⌒ 、ヽ　　 　　　　　　　　　　　　　　　　　　 ゝ　U　)
　　　　(　< 　　　ヽ　）　　　　　　　　　　　　　　　　　　　 ι｀-⊃
　　　⊂＿）　　　（＿つ◯




　　　　　　　　i⌒i
 　　　　　　　　|　|　　　(ﾟ)(ﾟ)
 　　　　　　　　|　|　　彡　　と　
 　　　　　　　　| |　＿ﾉ　　　ー､
 　　　　　　　（ミ)、　　　　!ﾌ　/
 　　　　　　　　￠＼二二二__ノ　　　　　　　　　　　　　 　　 （む）
 （さ、ここよ）　　　　|　　　 /　　　　　　　　　　　　　　　　　　　(・ω・´)
 (｀・ω・)　 　　　／ ソ⌒ 、ヽ　　　　　　　　　　　　　　　　　　　ヽ　　u)o
 （　　／　 　　 (　< 　　　ヽ　）　　　　　　　　　　　　　　　　　　　｀ｕ-ｕ'
 u○　u 　　　　⊂＿）　　　（＿つ



　 　 i⌒i
 　　　|　|　　　(ﾟ)(ﾟ)
 　　　|　|　　彡u　と
 　　 　| |　＿ﾉ　　　ー､
 　　　（ミ)、　　　　!ﾌ　/
 　　　￠＼二二二__ノ　　　　　　　　 　　`＝ニニﾌ'
 　　　　　　|　　　 　|　　　　　　　　　　　　　　Ltl;;;ﾉ(・ω・´)、
 　　　　 ／ ソ⌒ 、ヽ　　　　　　　　　　　　　 　└’ ヽ　　と)
 　　　　(　< 　　　ヽ　）　　　　　　　　　　　　　　　　　し-- ⊃
 　　　⊂＿）　　　（＿つ



　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　（ﾟ）（ﾟ）ミ
　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　 ﾉ　　　ミ　
　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　つ　　（
　　 　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　ノ　　　　ー､　
　　　　　 　　　 　　　　　　　　　　　　　　　　　　　　　　／　　　　人　｀i　　
　　　　　　　　　　　　　　　　　　　　　　　　　　　　　 /　,ｿ.　　　/　)　|　
ﾌｯ!　　　　　　　　ｼｭｯ!!　　　　　　　　　　　　　　　　/　/　|　　　/　(メ　　
≡≡≡≡＝─　⊂(・ω・´)、　　　＿＿＿　　　　/　　／　⌒　、ヽ　
　　　　　　　　　　　　 ヽ　　と)　 （＿＿＿二二二)ミﾘ (　< 　　　ヾ ）
　　　　　　　　　　　　　し-- ⊃　　　　　　　　　　　　⊂＿）　　⊂＿）　




　　　i⌒i 　　　　　
　　　|　|　　　(ﾟ)(ﾟ)　 　？
　　　|　|　　彡　　と 　
　　 　| |　＿ﾉ　　　ー､
　　　（ミ)、　　　　!ﾌ　/ 　　　　　　
　　　￠＼二二二__ノ　　　　　　　　　　　　　　　　　　　　　　 ｼｭｯ!!
二二○ 　|　　　 /　　　　　　　　　　　　　　　　　　　 (`・ω・)⊃ ─＝≡ニニ二二二二
　　　 　／ ソ⌒ 、ヽ　　　　　　　　　　　　　 　　　　 （つ　　/
　　　　(　< 　　　ヽ　）　　　　　　　　　　　　 　　　　　｀ｕ-ｕ'
　　　⊂＿）　　　（＿つ 　　　　　　



　　　　　　　　　　　　　　　　　　　　　　　　　　ｼｭｯ!
　 　 i⌒i　　　　　　　　　　　 ○≡≡≡≡＝─　⊂(・ω・´)、
　　　|　|　　　(ﾟ)(ﾟ)　　　　　　　　　　　　 　　　　　　　ヽ　　と)
　　　|　|　　彡u　と　　　　　　　　　　　　　　　ｼｭｯ!　　し-- ⊃
　　 　| |　＿ﾉ　　　ー､ 　　 ○≡≡≡≡＝─　⊂(・ω・´)、
　　　（ミ)、　　　　!ﾌ　/　　　　　　　　　　　　　　　　ヽ　　と)　
　　　￠＼二二二__ノ　　　　　　　　　　　　　ｼｭｯ!　　し-- ⊃
　　　　　　|　　　 　|　　　　○≡≡≡≡＝─　⊂(・ω・´)、
　　　　 ／ ソ⌒ 、ヽ　　　　　　　　　　　　　 　　　 ヽ　　と)
　　　　(　< 　　　ヽ　）　　　　　　　　　　　　　　　　　し-- ⊃
　　　⊂＿）　　　（＿つ



　　　i⌒i
 　　　|　|　　　(ﾟ)(ﾟ)
 　　　|　|　　彡　　と
 　　 　| |　＿ﾉ　　　ー､
 　　　（ミ)、　　　　!ﾌ　/
 　　　￠＼二二二__ノ　　　　　(ﾟ)(ﾟ)ミ　　　　ｼｭｯ!!
 　　　　　　|　　　 /　　　　　 　つ　　ミ二≡＝─　⊂(・ω・´)、
 　　　 　／ ソ⌒ 、ヽ　　　　　　　　　　　　　　　　　　　ヽ　　と)
 　　　　(　< 　　　ヽ　）　　　　　　　　　　　　　　　　　　　｀ｕ-ｕ'
 　　　⊂＿）　　　（＿つ



　　　 　 i⌒i
　　ド　　|　|　　(ﾟ)(ﾟ)
　　ド　　|　|　彡　　と　そろそろ本気で相手をしてやろう
　　ド　　| |ﾉ　　　　ー､
　　・　　（ミ)　　　!ﾌ　/
　　・　　￠＼二二_ノ　　　　　　　　　　　　　
　　　　　　|　　　 ＼＿　　　　　　　　　　　　　　　　　　　　　(・ω・；)
　　　 　／ ソ⌒・＿.、ヽ　　　　　　　　　　　　　　　　　　　　｜　　と)
　　　　(　< 　　　　　 ヽ　）　　　　　　　　　　　　　　　　　　 　し-- し
　　　⊂＿）　　　　　 （＿つ




　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　(´；ω；)
 　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　;:;,.:;:,,..,.,
 　　　　　　　(ﾟ)(ﾟ) 　　　　　　　　　　　　　　　　　　　　/　/　/　ﾊﾞﾁｭｰﾝ
 　　　　　　彡　　と 　　　　　　　　　　　　　　　　;::;;;ﾉ:;iゞ;::;;;ﾉ:;
 .(二二ﾆ=ＯＯ≡ｌ_ ﾉ　从　三三三三三三三三`::;:;.⑪'',:'':'`::"　
 　　　　　　 〉---9/　Ｗ 　　　　　　　　　　　　　　　ヽ　　と)
 　　　 　 　ﾉ_＼_＼ 　　　　　　　　　　　　　　　　　　し-- ⊃
 　　　 　　 し'　（＿) 　　　　　　　　　　　　



　　　i⌒i　　　　　　　　　　　ｼｭｯ!!
 　　　|　|　　　(ﾟ)(ﾟ)　　　( ;ω;´ )、　お母さんの敵！
 　　　|　|　　つ　u((◯三二≡＝─
 　　 　| |　＿ﾉ　　　ー､　　し-- ⊃
 　　　（ミ)、　　　　!ﾌ　/
 　　　￠＼二二二__ノ
 　　　　　　|　　　 /
 　　　 　／ ソ⌒ 、ヽ
 　　　　(　< 　　　ヽ　）
 　　　⊂＿）　　　（＿つ



　　　　　　　　(ﾟ)(ﾟ)　　　
 　　　　　　　彡　　と　　　
 　　 　　　＿ﾉ　　　ー､　　　＼＼＼　
 　　　　（　　＿＿＿ﾊ　ヽ　　 　ヽヽ＿＿__
 　　　　　ゝ＿＿＿__{＝(ｍ)ニニニ＿＿＿)
 　　　　　　|　　　 /　　　　　　　　　(´；ω；`)
 　　　 　／ ソ⌒ 、ヽ　　　　　　　　（　 　　）
 　　　　(　< 　　　ヽ　）　　　　　　　　｀ｕ-ｕ'
 　　　⊂＿）　　　（＿つ
 　　　◯,,,,..




　 　 i⌒i
　　　|　|　　　(ﾟ)(ﾟ)
　　　|　|　　彡　　と
　　 　| |　＿ﾉ　　　ー､
　　　（ミ)、　　　　!ﾌ　/
　　　￠＼二二二__ノ　　　　　　　　　　　　　
　　　　　│　　│　　　　　　　　　　　　　　　　　　 　　<(･ω･`)>
　　　　／ ソ⌒ 、ヽ　　　　　　　　　　　　　　　　　　　 　(＿(
　　　　(　< 　　　ヽ　）　　　　　　　　　　　　　　　　　((( く く )))
　　　⊂＿）　　　（＿つ



　　　　　　　　　　 　i⌒i
　　　　　　　　(ﾟ)(ﾟ)　|　|
　　　　　　　彡　`と |　|
　　　ミ　 　 ﾉ　　　ー| |　　　　ｶﾞｯ!!
　　　ミ　　（二二二（ミ)、_从._,　　　　　　　　　　　　　　　　　　　ｼｭｯ!
　　　　　 /　 ヽ～ノ　　　　◎≡≡≡≡≡≡≡≡≡≡≡＝＝─　⊂(・ω・´)、
　　　　　ヽ 　　　 /　　⌒Y⌒　　　　　　　　　 　　　　　　　　　　　　　　 ヽ　　と)

　　　　　　 、、;(⌒ヾ　⌒);;;;;i⌒i/⌒) ,/,　　,
　　　、　ヾ　ﾟ･*:.｡.:*　　(ﾟ)(ﾟ)*:｡|　|.*・ﾟ ;;）／.　,　 　
　、＼(⌒ゝ;(⌒ヾ　 　彡　`と 　 ⌒）／）) .,／ ,,
（(⌒-丶(;;　(⌒;;;人从;;;; ⌒;;;从人;;;,⌒;;⌒);;;;;））.)⌒)　　 　　　　　　∩(`・ω・´)∩



　 　 　　　　　　　　　　　 / ./
 　　　　　　　　(ﾟ)(ﾟ)　　　/ /
 　　　　　　　彡　`と　 / /
 　　 　　　　 ﾉ　　　ー､//　　ｷｰﾝ！
 　　　　　　（二二二（ミ)、
 　　　　　　/　 ヽ～ノ　　　!て　　　　　　　（U!!）、
 　　　　　　ヽ 　　　 /　　　　そ　─＝≡二三◯）ω；`)、
 　　　 　　／ ソ⌒ 、ヽ　　　　　　　　　　　　　　 ヽ　　と)
 　　　　ミ_,,／ 　　　ヽ ）



　 　 　　　　　　　　　　　 / ./
　　　　　　　　(ﾟ)(ﾟ)　　　/ /　
　　　　　　　彡　`と　 / /
　　 　　　　 ﾉ　　　ー､//　　ｷｰﾝ！
　　　　　　（二二二（ミ)、
　　　　　　/　 ヽ～ノ　　　!て　　　　　　　（U!!）、
　　　　　　ヽ 　　　 /　　　　そ　─＝≡二三（；●；`)、三◯
　　　 　　／ ソ⌒ 、ヽ　　　　　　　　　　　　　　 ヽ　　と)
　　　　ミ_,,／ 　　　ヽ ）



　 　 　　　　　　　　　　　 / ./
 　　　　　　　　　　 　　　/ /
 　　　　　　　 (｀・ω・)　/ /
 　　 　　　　 ﾉ　　　ー､//　　ｷｰﾝ！
 　　　　　　（二二二（ミ)、
 　　　　　　/　 ヽ～ノ　　　!て　　　　　　　
 　　　　　　ヽ 　　　 /　　　　そ　─＝≡二三◯）ω；`)、
 　　　 　　／ ソ⌒ 、ヽ　　　　　　　　　　　　　　 ヽ　　と)
 　　　　ミ_,,／ 　　　ヽ ）



　　　　　　　　(ﾟ)(ﾟ)　
　　　　　　　彡　`と　
　　 　　　　 ﾉ　　　ー､　ﾌﾞﾝｯ
　　　　　　（二二二（ミ)、
　　　　　　/　 ヽ～ノ　　　　　　　　　　　　　ﾄﾞｺﾞｫｯ!、
　　　　　　ヽ 　　　 /　　　　三C===二二二二）ω；`)、
　　　 　　／ ソ⌒ 、ヽ　ｺﾛｺﾛ　　　　　　　　 ヽ　　と)
　　　⊂＿）　　　（＿つ⑪))



　 　 i⌒i
 　　　|　|　　　(ﾟ)(ﾟ)
 　　　|　|　　彡　　と
 　　 　| |　＿ﾉ　　　ー､
 　　　（ミ)、　　　　!ﾌ　/
 　　　￠＼二二二__ノ
 　　　　　　|　　　 /　　　( ；ω； )
 　　　 　／ ソ⌒ 、ヽ　　(=====）
 　　　　(　< 　　　ヽ　）.　｀ｕ-ｕ'



　 　 i'` ,　　　　　　　　　　　　　　　　　　　 　(ＸωX）
 　　　ヽ　ヽ､( ﾟ)(　　　　　　　　　　　　　 　　/≡≡/
 　　　　 ＼　彡　と　　　　　　　　　　　　　　ｕ-ｕ
 　　 　　　　ﾉ　　　ー､　　　　ｶｷｰﾝ!!　　　　///
 　　　　　　/ 　（＿＿)　　　　　＿人
 　　　　　　|　　　　|　　　　　　＞　　 て
 　　　　　　|　　　　ヽ　　　　　　￣Ｖヽ!
 　　　 　　｜ ソ⌒ 、＼
 　　　　　　> 　>　　ヽ　＼　
 　　　　　　'――　　　`ー´


　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　 　　　　　　　　　　　i⌒i　
　　　　　　 　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　 (ﾟ)(ﾟ)ミ　 |　|　
　　　　　 　 　　 彡(ﾟ)(ﾟ)　　　　　　　　　　　　　　　　　　　　　　　　　ﾉ　　ミ_　 |　|　
　　　　 　　 　　彡　　と　　　　　　　　　　　　　　　　　　　　　　　　 つ　　(,＿　| |　
　　　　　　　と⌒ 　　 　て)　　　　　　　　　　　　　　　　　　　　　 ｉ　ﾌ!　　　　 ,.(ミ）
　　　　　　　　 （　　______三ﾌ　－－＝＝三三（´;ω;`）　　　　 　 !､__二二二／￠
　　　　　　　　　 )　　）　　　　　　　　　　　　　　　　　　　　　　　　　 ﾞｉ 　　　|　　　　
　　　　　　　　　 レ' 　　　　　　　　　　　　　　　　　　　　　　　　　 ,r' ,. ⌒ソ ＼　 　
　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　（　,r'　　　 >　)




　　　　　　　　　　　　　 　_＿　 (ﾟ)(ﾟ)ミ
　　　　　　　　　　　　　　(（　　つ　　ミ
　　　　　　　　　　　　　　　　とﾆ　（＃ゝ
　　　　　　　　　　　　　　　　　　し/　ﾉ　　　
　　　　　　　　　　　　　　　　　　 （__ﾉ
---------------------------------------------------
　　　　　　　　　　　　　　　＿　　 　 　 ／^)
　　　　　　　　　（ `・ω） /／　　 　 ／／
　　　　　　　　　（　　　つ　 _从_　　 ／　　ｶｷﾝ
　　　　　　　　　 (_ﾉヽ__) 　　W`




　 ＼　　／⌒ヽ
 　　 ＼＼・ω・´)ﾆ(#)
 　　 ⊂＼＼　ノ
 　　　　 ヽヾ_ミ
 　　　　　　し'　ﾋﾞｼｭ!!
 　　　　　l
 　 　 　　ll
 　 　 　　ll
 　 　 　　ll
 　 　 　　ll
 　 　 　　ll
 　 　 　　ll
 　 　 　　ll　　,
 　 　 　　ll　く ＼
 　 　 　　ll 　 ＼ ＼
 　 　 　　ll 　　　＼＼　　　　三　（ﾟ）ミミ、
 　 　 　　ll　　　　　＼＼　　三　 ﾉ ；ミミミ
 　 　 　　ll　　　　　　 (⌒ ヽ　　 つ　　（_　 　＜うわあぁっ
 　 　 　　ll　　　　　　　(＾＼＼ノ　　　　　）
 　 　 　　ll　　　　　　　 ⌒~＼__ノ　　　 ﾉ
 ｽﾞﾊﾞﾝ!!! ll　　　　　　　　三　　/　　　/




　 　 　　ll　　,
　 　 　　ll　く ＼
　 　 　　ll 　 ＼ ＼
　 　 　　ll 　　　＼＼　　　　三　（ﾟ）ミミ、
　 　 　　ll　　　　　＼＼　　三　 ﾉ ；ミミミ
─┐　　ll　　　　　　 (⌒ ヽ　　 つ　　（_　 　＜うわあぁっ
　 │　　ll　　　　　　　(＾＼＼ノ　　　　　）
　／ 　　ll　　　　　　　 ⌒~＼__ノ　　　 ﾉ
ｽﾞﾊﾞﾝ!!! ll　　　　　　　　三　　/　　　/

　　／　ボール！　＼


・バント

　 　　　　　　　　　＿＿
　　　ｷﾝ!!　　 　_/＿＿_ヽ　　
　 ∑　　　　　　(・ω・´∪
　　　 (二二ニO=　Yと　）
○⌒ 　 　　　　　しー-J



　 〇　ｷﾝ!!　　　　＿＿
　　　 　ヾ　　 　_/＿＿_ヽ
　　　　　M　　　(´・ω・`∪
　　　 (二二ニO=　Yと　）
　　　 　 　　　　　しー-J


　 　　　　　　＿＿
　　　ｷﾝ!! _/＿＿_ヽ　　
　 ∑　　　(｀・ω・´(）、
　　　 (二二Oニ=Yと ＼
○⌒ 　 　　　　　しー-J



　 　　　　　　　　　　＿＿
 　　　　　　　　 　_/＿＿_ヽ　　
 　(　´･ω･)　　　(・ω・´∪
 　（　　 (二二ニO=　Yと　）
 　　ｌ／ｌ/　　ﾄﾞｽｯ　しー-J



・リード

　 　　　　　　　　　 ＿＿
　　　　　　　　 　_/＿＿ ヽ　　　　ﾘｰﾘｰﾘｰﾘｰ
　　　　　　　 　 　（・ω・´U　
　　　　　　　　 ⊂(　Y　　⊃　) )
　　　　　　　　　　　し─Ｊ　　　　　　┌──┐



・実況、解説

　　　　　(｀・ω・´)　　　　　　　 (・ω・´)
 　　　　　●Ｙゝ　ヽ　　　　　　 ●Ｙゝ　ヽ　　 　 　　 　 　 　
 　＿＿_ﾉ∥.|　/　丿　 　 ＿ ﾉ∥ |　/　ﾉ　 　 　 　 　 　 　 　
 　|実況|＼￣￣￣￣￣|解説|＼￣￣￣￣￣￣￣￣



・ゲッツー

　○(￣￣￣）＿
　∩（｀・ω・´）
　 ＼　　　　 )(⌒)
　 /　/　/
　（_ノ､_ノ
　　ｌｌｌ　　　　∩　　　 　　　　　　　　　　　　　　　　　　　　　　ζ￣つ
　　　　　∩　＼ヽ　　　　　　　　　　　　　　　　　　　　　　　　 ﾉ r　　ζ￣つ　(´⌒(´´
　　　　　.＼ヽ　.＼＼(ﾟ)(ﾟ)ミ　　　　　　　　　　　ノ⌒ヽ 　　　./ /　／／　　　　(´⌒(´
　　　　　　　＼ヽ.　 つ　　ミミ　　￣￣￣￣￣　　　　＼＿/ /／／≡≡(´⌒;;;≡≡≡
　┌──┐　　＼二二二二_ノ─────´⌒~ヽ　　 ____ ノ_／　　(´⌒(´⌒;;
　　　　　　　　　　　　　　　　　　　　　　　　　　(´⌒(´⌒;;(´⌒(´⌒;;
　　　　　　　　　　　　　　　　　　　　　　　　　　　ｻﾞｼｬｱｰ


・原住民ボール

　　　　　　彡（ﾟ）（ﾟ）　　　　　　　/ / /
　　　　　彡　　　ヽ 　 　 　 　/ /　　/ /
　　　　 　_）　　　と　　 　　（・ω・`）つ
　　　　/__ 　 　　, -j　　　　 しーし´
　　　　l 　｀`‐､_ｧ‐く
　　__,,..lﾆ=-‐''(__)_ノ　　 ＿＿＿＿
　（　　__,. -''´ 　 ; ﾞi 　 /　　　　　 /
　　￣ 　 ）ﾆｰirァ‐'､　 ＼ 　 　 ／
　　　 　 !､__ ｀`'')￣　　　 ＼／



　　　　　　彡（ﾟ）（ﾟ）　　　　　/ /
 　　　　　彡　　　ヽ 　 　 / / 　ｶｸﾝ　
 　　　　 　_）　　　と　　 　　＼　＼　　
 　　　　/__ 　 　　, -j　　　　 （・ω・`）つ　　　
 　　　　l 　｀`‐､_ｧ‐く　　　　　しーし´
 　　__,,..lﾆ=-‐''(__)_ノ　　 ＿＿＿＿
 　（　　__,. -''´ 　 ; ﾞi 　 /　　　　　 /
 　　￣ 　 ）ﾆｰirァ‐'､　 ＼ 　 　 ／
 　　　 　 !､__ ｀`'')￣　　　 ＼／


*トンボ掛け
　　　|　　　　| 　　　i　　　　　i
　　i 　　　　　　　i 　　　　　　　 i
　　　　i　　　i　　　＿＿＿＿_＿/　　　i
　　　i　　　　　　| ..｀`‐-､._　　　 ＼
　　!　　 　　i　 　　　 　｀..`‐-､._　　＼　　
　　　　i　　　　　　　　.　　./ 　　..`‐-､＼i
　 i.　　　　　　　　　　　　/　 　　　　i
　　　　　　　　　　　　 (ﾟ)(ﾟ)ミ　
　( ´；ω；)っ　　　　 つ　　ミ
　（　　　つ＼　　　　　（　⊂)
　　し　Ｊ　　|＼　　　　しーＪ　
　　　　　　 ￣￣


・改変

　　　　　　　　　／::::::ヽ__　　　　　　　　　　　　　　　　　　　　　　[┴┴]ﾐ
　　　　　　　　　[:::彡(ﾟ)(ﾟ)　　　　　　　　　　　　　　　　　　　　　 〉´;ω;`] ､
　　　　　　　 ／⌒`＜_と､_,, --‐r--'´ヲ‐''彡＝===ﾆ二二二二二二)::/⌒)＼
　　　　　,,ィ彡´ /　　 `''ｰ─r'';;;;;;)-‐─､シ　　　　　　　　　　　 | {:::ゝ-':::::ﾉ　　l
　　 ,ｨ''´　　　　＞ テー─--´￣　　　　　　　　　　　　　　　　　|　'ｉ::::::::/〈　　　l
　／＼＼　　　彡'´　　　　　　　　　　　　　　　　　　　　　　　　 ﾄ-人:::::ヽ ｀ヽ_　]
　|　　　 〈ﾐー'''´　　　　　　　　　　　　　　　　　　　　　　　　　／:::ノ ヽﾆ/三ｿ::::ﾉ 〉
　'､　　　 | l　　　　　　　　　　　　　　　　　　　　　　　　　　　モｼﾞ´　　〉､:::::彡-‐'´|



　　　　(ﾟ)(ﾟ)ミｒｰ､
　　　 ﾉ　　 ミｰ) ＼
　　　 つ　 （　|_/⌒/　
　　　　 ｀レ￣｀ヽ〈
　　 　 　 |　　i＿_1　　　　　　 　　　　　　　　___ ｒ'⌒ヽ_
　　　　　_ゝ_／ ノ 　　　　　　　　　　　 　　／　　l､__,/}::＼
　　　 　 Ｌ__jイ´_　）　　　　　　　　　　　　(Ｔ´ |´･ω・ `};;_｣
　　　　　　　 |　　ｲ　　　　　　　　　　　　　. !　｀''ｧ､. ＼__｝
　　　　 　 　 |　　ﾉ--､ 　　　　　　　　　　　〈｀＾｀￢ﾉ . :〔
　　　　　　　 ゝ､_＿_ﾉ二７ 　　　. __,,,... --　|__ｲ-､_j|_: .　ヽ、 -- ...,,,__
　　　　　　 　 |ｰi |　　 l_/ _,, -‐ ´ 　 　　　ｒニﾄ,　　ﾌゝ __ 〉　　　　　｀　‐- ,,_　




　　 . .「 !
　 　. .| | 　　 .＿＿__
　 　 . | |　 　 |_＿_J_|＿　　
　 　 . l l　　　( `･ω･)　 　　　　
　　　　l l　r''",. ,.. - '' :. 　　　
　　 　 (~ 二二　-　''"i
　　　　 ` - '"l　　 　 ,i'
　　　　　　　 i'　 ,.　　i'
　. 　　　　　 'i,..　'i,　ﾉ
　　 　 　 　 　 〉　 .〉'　 　 　 　　　　.
　　 　 ┌ ''" /　 ./　 　 　 　　　　　.
　　　 　し ''.（＿___）




　　￣￣￣￣-----_______ ＼　|　/　／
 --------------------- （´;ω;`）
 ＿------------￣￣￣　　　　　　　　　
 　　　　　　 ∧ ∧　　　　／　/　|　　＼　　　　　ン
 　　　　　彡(ﾟ)(ﾟ)　　／ 　 /　 |　　　 ＼　　　ウ
 　　　　 ／　　　　＼／　 　/　　|　　　　　┌┴┐
 　　　／ /　　　/＼ ＼　　/　　 |　　　　　　　／
 　　　| L/　　　/　 ＼ ＼_,、　　│　 l　l ／
 　⊂［m/　　　|二二￣l　 (￣￣ ）　　／
 　　　 （　（.　　|　　　 ￣^^^￣￣　─┐
 　　　　ヽ, |　　|　　　/　　　　　　| ─┘


*試合結果

　　 __　　　　＿_r' ⌒ヽ　　　　　　へ
　 　 i. ﾂ　　　　（ﾟ）（ﾟ）了:） 　　 　 ゝ_!　　　　　原　４０１ ０１０ ０１２　　 ９
.　　　!_l　　　　 ﾉ　　　ミ　　　ノ ,/　 　 　 　 　 野　０１０ １００ ０１７X　１０
.　　　l　ゝ、　　ﾞつ　　（, ri' '　,/
　　　 ﾞゝ、　｀)"ｰ､._,r:'"｀　 l､,／
　　　　　 ヾ、　　 　 l :　 i ,／
　　　　　　　Y　　　 l :　 l'|
　　　　　　　　 /~ ニ口ﾆ{
　 　 　 　 　 　!　　 ヽ　ﾞ!　　 　　,　　　＿＿
　　　　　　　　　　＼　　 ）ﾞ! 　　　、　 /ﾞﾝﾆヽﾞヽ,
￣￣￣￣￣￣￣／ 　 /　ﾞ!"￣ ﾞ￣ト;（'；ω；`)ﾞl!￣￣￣￣￣￣￣
　　　　　　　　　 /ゝ,／ l　　!　　　　l.l l_/ヽ.ヽ,H、



　＿/__/＿ //　　 ヽ＼、ヽ 丶ヾ＼　ヽ　ゝ　丶丶　ヽ　　原 220　43
　　/　/　　　　　ーーーーーーーーーーーーーー　　..野 003　1
　　　/　　　　　　　　 　　ヽ＼、ヽ 丶ヾ＼　ヽ　ゝ　丶　　　　　　　（雨天ノーゲーム）
　ヽ ＼　丶＼丶ヽ＼　丶　ヾ丶　丶丶　＼丶　ヽ　＼　＼丶　ヽ ヾ　ゞ　丶
＼丶 丶＼ ＼.ヽ，丶＼丶ヽ＼ ＼丶ヽヾ ＼ 丶 ヽヾ＼　＼丶＼　＼ヾ　　ゝ
＼ ヽ　丶　ヾ丶　丶丶丶ヽ＼＿ _ ＼　＼丶ヾ　丶丶 ＼　、丶　＼　　＼　ヾ　丶　ｖ ＼
　 　　丶　ヾ丶　丶丶丶ヽ＼/＿原ヽ＿ ＼丶　、丶、ｖ　ヾ、　ゝ　ヽ、　ｖ丶ヾ　丶、
　丶　ヾ丶　丶丶　＼丶＼.(´・ω・`）丶、まだやれるでしょ＼ヽ　、丶＼　＼　 丶　ヽ丶　＼
　丶　ヾ丶　丶丶　＼丶＼/　し　o　ヽ 丶＼　、＼ヽ　、丶＼　＼　＼　ヾ 丶　ヽ　＼
ヽ　ヽヾ　 　丶　ヾ丶　丶丶しー-Ｊ ヽ　＼　＼丶、＼ヽ　、丶＼　＼　＼　　(ﾟ)(ﾟ)ヾ 丶　ヽ　丶　＼
　丶　ヾ丶　丶丶　＼丶　ヽ　＼　＼丶　＼　丶　丶　＼　丶 丶ヾ丶　＼彡；　　と　いや～ひどい雨だ
 */
int main() {

    int R, G, B, N;
    cin >> R >> G >> B >> N;
    int  ans = 0;
    int MAX = N + 1;
    for (int i = 0; i <= N / R; ++i) {
        //int r = i * R;
        //if (r > N){ break;}
        for (int j = 0; j <= N/ G; ++j) {
          //  if (i * R + j * G > N ){break;}
            int balls = i * R + j * G;
            if ((N - balls) % B == 0 && (N - balls) / B >= 0) {
                ans++;
            }
        }
    }
    cout << ans << endl;
}
